In [167]:
import pandas as pd

In [168]:
df1 = pd.read_csv('datasets/games1.csv')
df2 = pd.read_csv('datasets/games2.csv')

## 1. Assess data

### a. games1

In [169]:
df1.head()

   app_id                              title date_release   win    mac  linux
0   13500  Prince of Persia: Warrior Within™   2008-11-21  True  False  False
1   22364            BRINK: Agents of Change   2011-08-03  True  False  False
2  113020       Monaco: What's Yours Is Mine   2013-04-24  True   True   True
3  226560                 Escape Dead Island   2014-11-18  True  False  False
4  249050            Dungeon of the ENDLESS™   2014-10-27  True   True  False

In [170]:
df1.describe()

             app_id
count  5.087200e+04
mean   1.055224e+06
std    6.103249e+05
min    1.000000e+01
25%    5.287375e+05
50%    9.860850e+05
75%    1.524895e+06
max    2.599300e+06

In [171]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50872 entries, 0 to 50871
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   app_id        50872 non-null  int64
 1   title         50872 non-null  object
 2   date_release  50872 non-null  object
 3   win           50872 non-null  bool
 4   mac           50872 non-null  bool
 5   linux         50872 non-null  bool
dtypes: bool(3), int64(1), object(2)
memory usage: 1.3+ MB

In [172]:
# columns list
df1.columns

Index(['app_id', 'title', 'date_release', 'win', 'mac', 'linux'], dtype='object')

In [173]:
# Sum null values in date_release
df1.isnull().sum()

app_id          0
title           0
date_release    0
win             0
mac             0
linux           0
dtype: int64

In [174]:
# check for duplicate
df1.duplicated().sum()

0

#### Issue 1

date_release is currently object type, need to convert to datetime

In [175]:
# convert date_release to datetime
pd.to_datetime(df1['date_release'])

0       2008-11-21
1       2011-08-03
2       2013-04-24
3       2014-11-18
4       2014-10-27
           ...
50867   2023-09-28
50868   2023-09-21
50869   2023-09-11
50870   2023-10-19
50871   2023-10-23
Name: date_release, Length: 50872, dtype: datetime64[ns]

In [176]:
df1.head()

   app_id                              title date_release   win    mac  linux
0   13500  Prince of Persia: Warrior Within™   2008-11-21  True  False  False
1   22364            BRINK: Agents of Change   2011-08-03  True  False  False
2  113020       Monaco: What's Yours Is Mine   2013-04-24  True   True   True
3  226560                 Escape Dead Island   2014-11-18  True  False  False
4  249050            Dungeon of the ENDLESS™   2014-10-27  True   True  False

### b. games2

In [177]:
df2.head()

,app_id,rating,positive_ratio,user_reviews,price_final,price_original,discount,steam_deck
0,13500,Very Positive,84,2199,9.99,9.99,0.0,True
1,22364,Positive,85,21,2.99,2.99,0.0,True
2,113020,Very Positive,92,3722,14.99,14.99,0.0,True
3,226560,Mixed,61,873,14.99,14.99,0.0,True
4,249050,Very Positive,88,8784,11.99,11.99,0.0,True

In [178]:
df2.describe()

,app_id,positive_ratio,user_reviews,price_final,price_original,discount
count,5.087200e+04,50872.000000,5.087200e+04,50872.000000,50872.000000,50872.000000
mean,1.055224e+06,77.052033,1.824425e+03,8.620325,8.726788,5.592212
std,6.103249e+05,18.253592,4.007352e+04,11.514164,11.507021,18.606679
min,1.000000e+01,0.000000,1.000000e+01,0.000000,0.000000,0.000000
25%,5.287375e+05,67.000000,1.900000e+01,0.990000,0.990000,0.000000
50%,9.860850e+05,81.000000,4.900000e+01,4.990000,4.990000,0.000000
75%,1.524895e+06,91.000000,2.060000e+02,10.990000,11.990000,0.000000
max,2.599300e+06,100.000000,7.494460e+06,299.990000,299.990000,90.000000

In [179]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50872 entries, 0 to 50871
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   app_id          50872 non-null  int64
 1   rating          50872 non-null  object
 2   positive_ratio  50872 non-null  int64
 3   user_reviews    50872 non-null  int64
 4   price_final     50872 non-null  float64
 5   price_original  50872 non-null  float64
 6   discount        50872 non-null  float64
 7   steam_deck      50872 non-null  bool
dtypes: bool(1), float64(3), int64(3), object(1)
memory usage: 2.8+ MB

In [181]:
df2.isnull().sum()

app_id            0
rating            0
positive_ratio    0
user_reviews      0
price_final       0
price_original    0
discount          0
steam_deck        0
dtype: int64

In [180]:
df2.duplicated().sum()

0